Tests/HyperV/HyperV_performance.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16KiB each
2MiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      687.50
    writes/s:                     458.33
    fsyncs/s:                     1505.25

Throughput:
    read, MiB/s:                  10.74
    written, MiB/s:               7.16

General statistics:
    total time:                          10.2090s
    total number of events:              26558

Latency (ms):
         min:                                    0.00
         avg:                                    1.51
         max:                                   86.06
         95th percentile:                        5.99
         sum:                                39974.16

Threads fairness:
    events (avg/stddev):           6639.5000/254.54
    execution time (avg/stddev):   9.9935/0.00